Revit 2026 API

# ShapeBuilder Properties

---

The ShapeBuilder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ShapeBuilder Class

Autodesk.Revit.DB Namespace